mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2h1xg/common/s6e2h1xg.h
#define bFM_INTREQ_IRQ027MON_OCUINT0              *((volatile  uint8_t *)(0x42624E00UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT0             *((volatile  uint8_t *)(0x42624E00UL))
#define bFM_INTREQ_IRQ027MON_OCUINT1              *((volatile  uint8_t *)(0x42624E04UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT1             *((volatile  uint8_t *)(0x42624E04UL))
#define bFM_INTREQ_IRQ027MON_OCUINT2              *((volatile  uint8_t *)(0x42624E08UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT2             *((volatile  uint8_t *)(0x42624E08UL))
#define bFM_INTREQ_IRQ027MON_OCUINT3              *((volatile  uint8_t *)(0x42624E0CUL))
#define bFM4_INTREQ_IRQ027MON_OCUINT3             *((volatile  uint8_t *)(0x42624E0CUL))
#define bFM_INTREQ_IRQ027MON_OCUINT4              *((volatile  uint8_t *)(0x42624E10UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT4             *((volatile  uint8_t *)(0x42624E10UL))
#define bFM_INTREQ_IRQ027MON_OCUINT5              *((volatile  uint8_t *)(0x42624E14UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT5             *((volatile  uint8_t *)(0x42624E14UL))

#define bFM_INTREQ_IRQ028MON_FRT_PEAK_INT0        *((volatile  uint8_t *)(0x42624E80UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT0       *((volatile  uint8_t *)(0x42624E80UL))
#define bFM_INTREQ_IRQ028MON_FRT_PEAK_INT1        *((volatile  uint8_t *)(0x42624E84UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT1       *((volatile  uint8_t *)(0x42624E84UL))
#define bFM_INTREQ_IRQ028MON_FRT_PEAK_INT2        *((volatile  uint8_t *)(0x42624E88UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT2       *((volatile  uint8_t *)(0x42624E88UL))

#define bFM_INTREQ_IRQ029MON_FRT_ZERO_INT0        *((volatile  uint8_t *)(0x42624F00UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT0       *((volatile  uint8_t *)(0x42624F00UL))
#define bFM_INTREQ_IRQ029MON_FRT_ZERO_INT1        *((volatile  uint8_t *)(0x42624F04UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT1       *((volatile  uint8_t *)(0x42624F04UL))
#define bFM_INTREQ_IRQ029MON_FRT_ZERO_INT2        *((volatile  uint8_t *)(0x42624F08UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT2       *((volatile  uint8_t *)(0x42624F08UL))

#define bFM_INTREQ_IRQ030MON_ICUINT0              *((volatile  uint8_t *)(0x42624F80UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT0             *((volatile  uint8_t *)(0x42624F80UL))
#define bFM_INTREQ_IRQ030MON_ICUINT1              *((volatile  uint8_t *)(0x42624F84UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT1             *((volatile  uint8_t *)(0x42624F84UL))
#define bFM_INTREQ_IRQ030MON_ICUINT2              *((volatile  uint8_t *)(0x42624F88UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT2             *((volatile  uint8_t *)(0x42624F88UL))
#define bFM_INTREQ_IRQ030MON_ICUINT3              *((volatile  uint8_t *)(0x42624F8CUL))
#define bFM4_INTREQ_IRQ030MON_ICUINT3             *((volatile  uint8_t *)(0x42624F8CUL))

#define bFM_INTREQ_IRQ031MON_OCUINT0              *((volatile  uint8_t *)(0x42625000UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT0             *((volatile  uint8_t *)(0x42625000UL))
#define bFM_INTREQ_IRQ031MON_OCUINT1              *((volatile  uint8_t *)(0x42625004UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT1             *((volatile  uint8_t *)(0x42625004UL))
#define bFM_INTREQ_IRQ031MON_OCUINT2              *((volatile  uint8_t *)(0x42625008UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT2             *((volatile  uint8_t *)(0x42625008UL))
#define bFM_INTREQ_IRQ031MON_OCUINT3              *((volatile  uint8_t *)(0x4262500CUL))
#define bFM4_INTREQ_IRQ031MON_OCUINT3             *((volatile  uint8_t *)(0x4262500CUL))
#define bFM_INTREQ_IRQ031MON_OCUINT4              *((volatile  uint8_t *)(0x42625010UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT4             *((volatile  uint8_t *)(0x42625010UL))
#define bFM_INTREQ_IRQ031MON_OCUINT5              *((volatile  uint8_t *)(0x42625014UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT5             *((volatile  uint8_t *)(0x42625014UL))

#define bFM_INTREQ_IRQ032MON_FRT_PEAK_INT0        *((volatile  uint8_t *)(0x42625080UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT0       *((volatile  uint8_t *)(0x42625080UL))
#define bFM_INTREQ_IRQ032MON_FRT_PEAK_INT1        *((volatile  uint8_t *)(0x42625084UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT1       *((volatile  uint8_t *)(0x42625084UL))
#define bFM_INTREQ_IRQ032MON_FRT_PEAK_INT2        *((volatile  uint8_t *)(0x42625088UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT2       *((volatile  uint8_t *)(0x42625088UL))

#define bFM_INTREQ_IRQ033MON_FRT_ZERO_INT0        *((volatile  uint8_t *)(0x42625100UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT0       *((volatile  uint8_t *)(0x42625100UL))
#define bFM_INTREQ_IRQ033MON_FRT_ZERO_INT1        *((volatile  uint8_t *)(0x42625104UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT1       *((volatile  uint8_t *)(0x42625104UL))
#define bFM_INTREQ_IRQ033MON_FRT_ZERO_INT2        *((volatile  uint8_t *)(0x42625108UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT2       *((volatile  uint8_t *)(0x42625108UL))

#define bFM_INTREQ_IRQ034MON_ICUINT0              *((volatile  uint8_t *)(0x42625180UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT0             *((volatile  uint8_t *)(0x42625180UL))
#define bFM_INTREQ_IRQ034MON_ICUINT1              *((volatile  uint8_t *)(0x42625184UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT1             *((volatile  uint8_t *)(0x42625184UL))
#define bFM_INTREQ_IRQ034MON_ICUINT2              *((volatile  uint8_t *)(0x42625188UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT2             *((volatile  uint8_t *)(0x42625188UL))
#define bFM_INTREQ_IRQ034MON_ICUINT3              *((volatile  uint8_t *)(0x4262518CUL))
#define bFM4_INTREQ_IRQ034MON_ICUINT3             *((volatile  uint8_t *)(0x4262518CUL))

#define bFM_INTREQ_IRQ035MON_OCUINT0              *((volatile  uint8_t *)(0x42625200UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT0             *((volatile  uint8_t *)(0x42625200UL))
#define bFM_INTREQ_IRQ035MON_OCUINT1              *((volatile  uint8_t *)(0x42625204UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT1             *((volatile  uint8_t *)(0x42625204UL))
#define bFM_INTREQ_IRQ035MON_OCUINT2              *((volatile  uint8_t *)(0x42625208UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT2             *((volatile  uint8_t *)(0x42625208UL))
#define bFM_INTREQ_IRQ035MON_OCUINT3              *((volatile  uint8_t *)(0x4262520CUL))
#define bFM4_INTREQ_IRQ035MON_OCUINT3             *((volatile  uint8_t *)(0x4262520CUL))
#define bFM_INTREQ_IRQ035MON_OCUINT4              *((volatile  uint8_t *)(0x42625210UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT4             *((volatile  uint8_t *)(0x42625210UL))
#define bFM_INTREQ_IRQ035MON_OCUINT5              *((volatile  uint8_t *)(0x42625214UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT5             *((volatile  uint8_t *)(0x42625214UL))

#define bFM_INTREQ_IRQ036MON_PPGINT0              *((volatile  uint8_t *)(0x42625280UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT0             *((volatile  uint8_t *)(0x42625280UL))
#define bFM_INTREQ_IRQ036MON_PPGINT1              *((volatile  uint8_t *)(0x42625284UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT1             *((volatile  uint8_t *)(0x42625284UL))
#define bFM_INTREQ_IRQ036MON_PPGINT2              *((volatile  uint8_t *)(0x42625288UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT2             *((volatile  uint8_t *)(0x42625288UL))

#define bFM_INTREQ_IRQ037MON_PPGINT0              *((volatile  uint8_t *)(0x42625300UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT0             *((volatile  uint8_t *)(0x42625300UL))
#define bFM_INTREQ_IRQ037MON_PPGINT1              *((volatile  uint8_t *)(0x42625304UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT1             *((volatile  uint8_t *)(0x42625304UL))
#define bFM_INTREQ_IRQ037MON_PPGINT2              *((volatile  uint8_t *)(0x42625308UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT2             *((volatile  uint8_t *)(0x42625308UL))

